In [1]:
import pandas as pd
data1 = pd.Series([10,5,2,2,7], index = ["철수","영희","민수","칠성","펩시"])
data1.index.name ="이름"
data1

이름
철수    10
영희     5
민수     2
칠성     2
펩시     7
dtype: int64

In [2]:
data1["철수"]

10

In [3]:
data1.loc["철수"]

10

In [4]:
data1.iloc[0]

10

In [5]:
data1[["민수",'펩시']]

이름
민수    2
펩시    7
dtype: int64

In [6]:
data1.loc[["민수",'펩시']]

이름
민수    2
펩시    7
dtype: int64

In [9]:
data1.iloc[[2,4]]

이름
민수    2
펩시    7
dtype: int64

In [10]:
# index 확인
data1.index

Index(['철수', '영희', '민수', '칠성', '펩시'], dtype='object', name='이름')

In [11]:
# 값확인
data1.values

array([10,  5,  2,  2,  7], dtype=int64)

In [12]:
# 값 정렬
sorted(data1)
sorted(data1.values)

[2, 2, 5, 7, 10]

In [17]:
#인덱스 정렬
sorted(data1.index)

['민수', '영희', '철수', '칠성', '펩시']

In [19]:
#index로 정렬한대로 재정렬하기
data1.reindex(sorted(data1.index))

이름
민수     2
영희     5
철수    10
칠성     2
펩시     7
dtype: int64

In [20]:
#index 재설정
new_index = ['철수', '칠성', '펩시','민수', '영희']
data1.reindex(new_index)

이름
철수    10
칠성     2
펩시     7
민수     2
영희     5
dtype: int64

In [21]:
data2 = pd.Series([10,5,2,2,7], index = ["철수","영희","영주","콜라","펩시"])
data2

철수    10
영희     5
영주     2
콜라     2
펩시     7
dtype: int64

In [23]:
# 양쪽으로 다 존재하지 않는 index는 NaN값 생성
data1+ data2

민수     NaN
영주     NaN
영희    10.0
철수    20.0
칠성     NaN
콜라     NaN
펩시    14.0
dtype: float64

In [24]:
# 유일한 값 뽑기
data1.unique()

array([10,  5,  2,  7], dtype=int64)

In [26]:
#딕셔너리로 시리즈 만들기
# 딕셔너리의 키값이 index로 들어가는 것을 알 수 있음
medal = {"금":10, "은":3,"동":12}
data3= pd.Series(medal)
data3

금    10
은     3
동    12
dtype: int64

In [30]:
#딕셔너리로 데이터 프레임을 만들 경우 컬럼 지정을 따로 안해줘도 됨
person = {"age":[23,41,62,9],
          "name":["벤","광수","재석","종국"],
          "height":[152,190,178,185]}
data4 = pd.DataFrame(person, columns = ["name","age","height"]) 
data4

  name  age  height
0    벤   23     152
1   광수   41     190
2   재석   62     178
3   종국    9     185

In [33]:
# 컬럼명으로 데이터 값 확인하기
# 아래 두개가 같은 값임
print(data4["age"])
print(data4.age)

0    23
1    41
2    62
3     9
Name: age, dtype: int64
0    23
1    41
2    62
3     9
Name: age, dtype: int64

In [42]:
# 2,3번째 row 출력
data4.iloc[[2,3]]
data4.iloc[1:3] #slicing 이용

  name  age  height
1   광수   41     190
2   재석   62     178

In [48]:
# 2,3번째 col 추출
data4.iloc[:,[1,2]]
data4.iloc[:,1:3]

   age  height
0   23     152
1   41     190
2   62     178
3    9     185

In [51]:
# loc 이용
data4.loc[[1,2]]

  name  age  height
1   광수   41     190
2   재석   62     178

In [52]:
data4.loc[:,["name","age"]]

  name  age
0    벤   23
1   광수   41
2   재석   62
3   종국    9

In [54]:
data4.head(3)
data4[:3]

  name  age  height
0    벤   23     152
1   광수   41     190
2   재석   62     178

In [55]:
data4.tail(2)
data4[-2:]

  name  age  height
2   재석   62     178
3   종국    9     185

In [56]:
# bool형 이용해서 2,3행만 뽑기
bool_list = [False, True, True, False]
data4[bool_list]

  name  age  height
1   광수   41     190
2   재석   62     178

In [57]:
# bool형 이용해서 age열에서 2,4번째 뽑기
bool_list = [False, True, True, False]
data4.age[bool_list]

1    41
2    62
Name: age, dtype: int64

In [59]:
data4.mean()

age        33.75
height    176.25
dtype: float64

In [58]:
data4.age.mean(axis=0)

33.75

In [63]:
#데이터형 float로 바꾸기
data4.height.astype("float")

0    152.0
1    190.0
2    178.0
3    185.0
Name: height, dtype: float64

In [ ]:
123